prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_FSE_2009-01_cancellaDCEDaFolder.in.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<!--
<TestInfo>
	<Autore>Imed Cherigui</Autore>
	<DataPreparazione>03/02/2010</DataPreparazione>
	<CodiceTest>IN.80674000001</CodiceTest>
	<CodiceContesto>C06</CodiceContesto>
	<TipoTest>F</TipoTest>
	<Priorita>H</Priorita>
	<DescrizioneCaso>Cancellazione di un DCE da un Folder, accesso in assenza di smartcard cittadino: operatore abilitato al servizio(Medico di Pronto Soccorso / codice=2) </DescrizioneCaso>
	<DescrizioneRisultatoAtteso>ok</DescrizioneRisultatoAtteso>
	<confrontoBody>
		<ignora>codicePDT</ignora>
	</confrontoBody></TestInfo>
-->
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<soap-env:Header>
		<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
			<Transport>
				<Mode>Sync</Mode>
				<Dest>DCSanita</Dest>
			</Transport>
			<Security>
				<FunContext>
					<credential>
						<validity>
							<emittedDate>10/01/2008+10:59:18,531</emittedDate>
							<sessionMaxTime>10/01/2008+10:59:18,531</sessionMaxTime>
						</validity>
						<vrs>
							<mjr></mjr>
							<min></min>
						</vrs>
						<ctf>
							<reg>
								<cod></cod>
								<des/>
							</reg>
							<app>
								<cod></cod>
								<des/>
							</app>
							<pro>
								<cod></cod>
								<des/>
							</pro>
							<ter>
								<cod></cod>
								<des/>
							</ter>
							<str>
								<cod>19722</cod>
								<des/>
							</str>
							<pre>
								<cod></cod>
								<des/>
							</pre>
							<rep>
								<cod></cod>
								<des/>
							</rep>
						</ctf>
						<role>
							<code>2</code>
							<description>Operatore abilitato al servizio</description>
						</role>
						<FirstName>MARCO</FirstName>
						<LastName>ROSSI</LastName>
						<userId>PDTMED10A10A010A</userId>
						<iupSeed></iupSeed>
					</credential>
				</FunContext>
				<CitCardPresent>false</CitCardPresent>
				<CitAuth>false</CitAuth>
				<CitCF>PDTCIT10A10A010A</CitCF>
				<CitSmartCardSN></CitSmartCardSN>
			</Security>
			<Sla>
				<Log>
					<Global>
						<TrackID>0000000000001</TrackID>
						<Timestamp>16/07/2009+18:47:18,562</Timestamp>
					</Global>
				</Log>
			</Sla>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2004-01/appcontext/">
			<Request clientProd="DCSanita" clientVer="1.0"/> 									
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
		<m:FSE.cancellaDCEDaFolder xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/FSE/2009-01/cancellaDCEDaFolder/" dataSetVersion="1.0">
			<DCEDaFolder>				
				<documentoClinicoElettronico>
 		           <idSetDocumenti>20</idSetDocumenti>                            
				</documentoClinicoElettronico>						
			    <cittadino>
                   <idCittadino tipo="CF">PDTCIT10A10A010A</idCittadino>                   
                </cittadino>
                <datiFolder>
                   <idFolder>183906606</idFolder>
                   <idTipoFolder>51</idTipoFolder>                   
                </datiFolder>
			    <attributiSpecifici>
                   <codicePDT>A.428</codicePDT>
                </attributiSpecifici>
			</DCEDaFolder>
		</m:FSE.cancellaDCEDaFolder>
	</soap-env:Body>
</soap-env:Envelope>